/* SPDX-FileCopyrightText: 2002-2021 AIM GmbH <info@aim-online.com> */
/* SPDX-License-Identifier: MIT OR GPL-2.0-or-later */

#ifndef __INI_TYPE_DEF__
#define __INI_TYPE_DEF__

#ifdef _AIM_SYSDRV
  #ifdef _AIM_WINDOWS
    #include "Ai_cdef.h"
  #endif
  #ifdef _AIM_LINUX
    #include "./Ai_cdef.h"
  #endif
  #ifdef _AIM_QNX
    #include "Ai_cdef.h"
  #endif
  #ifdef __LYNX_OS__
    #include "./Ai_cdef.h"
  #endif
#elif defined __monitor__
  #include "Ai_cdef.h"
#elif defined _SMARTLIB
  #include "Ai_cdef.h"
#else
  #include "../Ai_cdef.h"
#endif


#include "defs.h"

/*******************************************************/
/* Type Definitions for compatibility with other CPU-S */
/*******************************************************/

/* ------ from JTAG Program ------ */
/* the lenVal structure is a byte oriented type used to store an */
/* arbitrary length binary value. As an example, the hex value   */
/* 0x0e3d is represented as a lenVal with len=2 (since 2 bytes   */
/* and val[0]=0e and val[1]=3d.  val[2-MAX_LEN] are undefined    */

/* maximum length (in bytes) of value to read in        */
/* this needs to be at least 4, and longer than the     */
/* length of the longest SDR instruction.  If there is, */
/* only 1 device in the chain, MAX_LEN must be at least */
/* ceil(27/8) == 4.  For 6 devices in a chain, MAX_LEN  */
/* must be 5, for 14 devices MAX_LEN must be 6, for 20  */

    /* jtag */

    lenVal TDOMask; /* last TDOMask received */
    lenVal maxRepeat; /* max times tdo can fail before ISP considered failed */
    lenVal runTestTimes; /* value of last XRUNTEST instruction */

    /* v01.08, 22/09/2004 */
    union
    {
        AiUInt32 all;
        struct
        {
#ifdef HOST_ENDIAN_BIG
            AiUInt32            : 31; /* reserved*/
            AiUInt32 BATCH_MODE : 1;  /* Batch Mode*/
            AiUInt32            : 0;  /* alignment*/
#else
            AiUInt32 BATCH_MODE : 1;  /* Batch Mode*/
            AiUInt32            : 31; /* reserved */
            AiUInt32            : 0;  /* alignment*/
#endif
        } Reg;
    } STATUS_FLAGS;
    /* v01.08 end */
    /*ML 29/07/2005 Aenderung*/

    struct
    {
        AiUInt32 argv1;
        AiUInt32 argv2;
        AiUInt32 argv3;
        AiUInt32 argc;
		AiUInt32 NetChipVersion;
    } STATUS;

    /*v02.13, 16.10.07            */
    /*optional path for srec files*/
    AiInt8 path[MON_MAX_PATH];
    AiInt8 temp_path[MON_MAX_PATH];

#ifdef _SMARTLIB
    AiUInt32 ul_ApiModuleHandle;
    AiUInt32 ul_MemLengthTcpUpdate;
    AiUInt32 ul_NovRamBackupMemSize;
#endif

    /* ML, V02.22 JTAG update NET228x */
    AiUInt32 net228x_sys;

} TY_MONITOR_DATA_STRUCT;

/*******************************************************/
/* other structs                                       */
/*******************************************************/

#ifdef __monitor__
/* ------ from JTAG Program ------ */
/* the lenVal structure is a byte oriented type used to store an */
/* arbitrary length binary value. As an example, the hex value   */
/* 0x0e3d is represented as a lenVal with len=2 (since 2 bytes   */
/* and val[0]=0e and val[1]=3d.  val[2-MAX_LEN] are undefined    */

/* maximum length (in bytes) of value to read in        */
/* this needs to be at least 4, and longer than the     */
/* length of the longest SDR instruction.  If there is, */
/* only 1 device in the chain, MAX_LEN must be at least */
/* ceil(27/8) == 4.  For 6 devices in a chain, MAX_LEN  */
/* must be 5, for 14 devices MAX_LEN must be 6, for 20  */
/* devices MAX_LEN must be 7, etc..                     */
/* You can safely set MAX_LEN to a smaller number if you*/
/* know how many devices will be in your chain.         */

/*typedef struct var_len_byte*/
/*{*/
/*    AiInt16     len;       *//* number of chars in this value */
/*    AiUInt8      val[1000]; *//* bytes of data *//*6+1*/
/*} lenVal;*/
/* put into global struct*/

extern AiUInt32 DumpUpdate;

#endif

/* ****************************************************
 * NET2282 Command Struct                           *
 * Read with NET2282_init() to get all necessary    *
 * variables for correct communication              *
 * with USB devices (APU, AFDX-TAP)                 *
 **************************************************** */

typedef struct
{
    AiUInt8 status;             /* 0          8051 */
    AiUInt8 command_count;      /* 1          8051 */
    AiUInt8 livecounter;        /* 2          8051 */
    AiUInt8 failure;            /* 3          8051 */
    AiUInt8 debug1;             /* 4          8051 */
    AiUInt8 debug2;             /* 5          8051 */
    AiUInt8 debug3;             /* 6          8051 */
    AiUInt8 debug4;             /* 7          8051 */
    AiUInt16 byte_completed1;   /* 8-9        8051 */
    AiUInt16 byte_completed2;   /* 10-11      8051 */
    AiUInt16 pointer1;          /* 12-13      8051 */
    AiUInt16 size1;             /* 14-15      8051 */
    AiUInt16 pointer2;          /* 16-17      8051 */
    AiUInt16 size2;             /* 18-19      8051 */
    AiUInt32 bar0;              /* 20-23      8051 */
    AiUInt32 bar1;              /* 24-27      8051 */
    AiUInt32 idsel;             /* 28-31      8051 */
    AiUInt32 netchip_id;        /* 32-35      8051 */
    AiUInt8 reserved1[25];      /* 36-60      8051 */
    AiUInt8 version;            /* 61         8051 */
    AiUInt8 revision;           /* 62         8051 */
    AiUInt8 build;              /* 63         8051 */
    AiUInt16 bytecount1;        /* 64-65        PC */
    AiUInt16 bytecount2;        /* 66-67        PC */
    AiUInt16 startpage1;        /* 68-69        PC */
    AiUInt16 endpage1;          /* 70-71        PC */
    AiUInt16 startpage2;        /* 72-73        PC */
    AiUInt16 endpage2;          /* 74-75        PC */
    AiUInt8 reserved2[4];       /* 76-79        PC */
    AiUInt8 command;            /* 80           PC */
    AiUInt8 reserved3[3];       /* 81-83        PC */
    AiUInt32 XRUNTEST_value;    /* stored value of XRUNTEST   84-87 */
    AiUInt32 XSDRSIZE_value;    /* stored value of XSDRSIZE   88-91 */
    AiUInt32 magic;             /*                            92-95 */
    AiUInt8 XREPEAT_value;      /*                            96    */
    AiUInt8 reserved4[31];      /*                            97-127 */
} NET2282_TY;

typedef struct
{
    AiUInt16 bytecount1;        /* 64-65        PC */
